ERP.belugaerp/src/Documents/битУстановкаСуммовыхСкидок/битУстановкаСуммовыхСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битУстановкаСуммовыхСкидок</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_СуммовыеСкидки</registerRecords>
  <registerRecords>AccumulationRegister.бг_СуммовыеСкидкиЛокальные</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СкидкиГлобальные</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерва</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Резервы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиЛокальные</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктНазначения</name>
      <type>
        <types>CatalogRef.битПунктыНазначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаПоПартнерам</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КСписанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битУстановкаСуммовыхСкидок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("бг_СкидкиНаценки");
	
КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Запрос        = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		
		ЗаполнитьПараметрыИнициализации(Запрос, Документ);
		
		ТекстЗапросаТаблицаСуммовыеСкидиГлобальные(Запрос, ТекстыЗапроса, Регистры);
		ТекстЗапросаТаблицаСуммовыеСкидиЛокальные(Запрос, ТекстыЗапроса, Регистры);
		
	КонецЕсли;
		
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата");
	Запрос.УстановитьПараметр("Период", СтруктураРеквизитов.Дата);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаСуммовыеСкидиГлобальные(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "бг_СуммовыеСкидки";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УстановкаСуммовыхСкидокСкидки.Ссылка.Дата КАК Период,
	|	УстановкаСуммовыхСкидокСкидки.Контрагент КАК Контрагент,
	|	УстановкаСуммовыхСкидокСкидки.ДокументРезерва КАК ДокументРезерва,
	|	СУММА(УстановкаСуммовыхСкидокСкидки.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(УстановкаСуммовыхСкидокСкидки.СуммаРезерва) КАК СуммаРезерва
	|ИЗ
	|	Документ.битУстановкаСуммовыхСкидок.СкидкиГлобальные КАК УстановкаСуммовыхСкидокСкидки
	|ГДЕ
	|	УстановкаСуммовыхСкидокСкидки.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаСуммовыхСкидокСкидки.Ссылка.Дата,
	|	УстановкаСуммовыхСкидокСкидки.Контрагент,
	|	УстановкаСуммовыхСкидокСкидки.ДокументРезерва";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТаблицаСуммовыеСкидиЛокальные(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "бг_СуммовыеСкидкиЛокальные";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СкидкиЛокальные.Ссылка.Дата КАК Период,
	|	СкидкиЛокальные.Организация КАК Организация,
	|	СкидкиЛокальные.Контрагент КАК Контрагент,
	|	СкидкиЛокальные.ПунктНазначения КАК ПунктНазначения,
	|	СкидкиЛокальные.СкидкаНаценка КАК СкидкаНаценка,
	|	СУММА(СкидкиЛокальные.Начислено) КАК Начислено
	|ИЗ
	|	Документ.битУстановкаСуммовыхСкидок.СкидкиЛокальные КАК СкидкиЛокальные
	|ГДЕ
	|	СкидкиЛокальные.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СкидкиЛокальные.Ссылка.Дата,
	|	СкидкиЛокальные.Организация,
	|	СкидкиЛокальные.Контрагент,
	|	СкидкиЛокальные.ПунктНазначения,
	|	СкидкиЛокальные.СкидкаНаценка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

#КонецОбласти

#КонецЕсли
